Revit 2027 API
BuiltInFailures.StairRampFailures.RailTypeChangeInconsistancyWarningWithResetBtn Property
 Some rail type changes are not consistent with your rail instances customization in this project, you can reset them to make them corresponding with your changes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailTypeChangeInconsistancyWarningWithResetBtn { get; }
Public Shared ReadOnly Property RailTypeChangeInconsistancyWarningWithResetBtn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailTypeChangeInconsistancyWarningWithResetBtn {
	FailureDefinitionId^ get ();
}
static member RailTypeChangeInconsistancyWarningWithResetBtn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace